In [1]:
import pandas as pd
pd.read_excel('SDB.xlsx')

  Student Name  Class Section  Roll_no  CGPA
0        Akash     12       A       13   9.3
1          Ram     11       C       20   8.5
2        Ragav     12       B       21   8.9
3      Gautham     10       A        7   7.8
4          Abu     11       D        1   8.3
5        Danny     11       A        5   9.0
6      Qureshi     10       B        3   8.8
7     Subiksha     12       A       31   8.5
8        Feroz     11       B       27   7.9
9        Ramya     12       E       35   9.6

In [2]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="",
)

mycursor = mydb.cursor()
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001E7265AC970>

In [25]:
dbse = mydb.cursor()

dbse.execute("CREATE DATABASE Students_Management_Systems")

In [6]:
mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="",
  database="students_management_system"
)
dbse = mydb.cursor()

dbse.execute("CREATE TABLE student (Student VARCHAR(250),Class INT(10),Section VARCHAR(10), Roll_no INT(25), CGPA INT(35))")

In [7]:
dbse = mydb.cursor()

dbse.execute("SHOW TABLES")

for value in dbse:
  print(value)

('student',)

In [9]:
cur = mydb.cursor()
cur.execute('SELECT * FROM student')
for row in cur:
    print(row)

In [10]:
import pandas as pd

df = pd.read_excel('SDB.xlsx')

In [15]:
import xlrd
import MySQLdb
xl_sheet = xlrd.open_workbook("SDB.xls")
xl_sheet

In [16]:
sheet_name =xl_sheet.sheet_names()
sheet_name

['Sheet1']

In [19]:
mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="",
  database="students_management_system"
)

cur = mydb.cursor()
for s in range(0,1):
    sheet=xl_sheet.sheet_by_index(s)
    sql= "INSERT INTO student(Student, Class, Section, Roll_no , CGPA ) VALUES(%s,%s,%s,%s,%s)"
    for r in range(1,sheet.nrows):
        Student =sheet.cell(r,0).value
        Class =sheet.cell(r,1).value
        Section =sheet.cell(r,2).value
        Roll_no=sheet.cell(r,3).value
        CGPA =sheet.cell(r,4).value
      
        values =(Student, Class, Section, Roll_no , CGPA )
        
        cur.execute(sql,values)
mydb.commit()

In [21]:
mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM student")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Akash', 12, 'A', 13, 9)
('Ram', 11, 'C', 20, 9)
('Ragav', 12, 'B', 21, 9)
('Gautham', 10, 'A', 7, 8)
('Abu', 11, 'D', 1, 8)
('Danny', 11, 'A', 5, 9)
('Qureshi', 10, 'B', 3, 9)
('Subiksha', 12, 'A', 31, 9)
('Feroz', 11, 'B', 27, 8)
('Ramya', 12, 'E', 35, 10)

In [24]:
mycursor = mydb.cursor()

mycursor.execute("SELECT Student FROM student WHERE CGPA >8")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Akash',)
('Ram',)
('Ragav',)
('Danny',)
('Qureshi',)
('Subiksha',)
('Ramya',)